Repository: mkemiazhuk/weekfit
Catalog: WeekFit/Localizable.xcstrings
Source language: en
Languages: ru, zh_hans

# settings.nightComfort.subtitle
source: Choose when WeekFit softens brightness, glow, and accent intensity.
ru: Выберите, когда WeekFit смягчает яркость, свечение и насыщенность акцентов.
zh_hans: 选择 WeekFit 何时调节亮度、光效及强调色强度。

# settings.nightComfort.title
source: Night Comfort
ru: Ночной комфорт
zh_hans: 夜间舒适体验

# settings.notifications.activityReminders.subtitle
source: Scheduled activity reminders
ru: Запланированные напоминания об активности
zh_hans: 已计划的活动提醒

# settings.notifications.activityReminders.title
source: Activity Reminders
ru: Напоминания об активности
zh_hans: 活动提醒

# settings.notifications.completionCheckIns.subtitle
source: Confirm completed or skipped
ru: Подтверждайте выполнение или пропуск
zh_hans: 确认已完成或已跳过

# settings.notifications.completionCheckIns.title
source: Completion Check-ins
ru: Проверки выполнения
zh_hans: 任务完成确认

# settings.notifications.footerNote
source: Notifications help WeekFit keep your wellness routine visible without overwhelming your day.
ru: Уведомления помогают WeekFit держать ваш режим на виду, не перегружая день.
zh_hans: 通知功能让 WeekFit 助您随时掌握健康习惯的进展，而不会让您的日常生活感到不堪重负。

# settings.notifications.hydrationReminders.subtitle
source: Light nudges to drink water
ru: Легкие напоминания пить воду
zh_hans: 用灯光提示饮水

# settings.notifications.hydrationReminders.title
source: Hydration Reminders
ru: Напоминания о воде
zh_hans: 补液提醒

# settings.notifications.morningPlanCheck.subtitle
source: Notify when Coach has morning adjustments ready
ru: Уведомление, когда у коуча готовы утренние правки
zh_hans: 当教练准备好晨间调整方案时，及时通知。

# settings.notifications.morningPlanCheck.title
source: Morning Plan Check
ru: Утренняя проверка плана
zh_hans: 晨间计划核查

# settings.notifications.recoverySuggestions.subtitle
source: Gentle guidance after active days
ru: Мягкие рекомендации после активных дней
zh_hans: 活跃日后的温和引导

# settings.notifications.recoverySuggestions.title
source: Recovery Suggestions
ru: Советы по восстановлению
zh_hans: 恢复建议

# settings.notifications.section.activity
source: ACTIVITY
ru: АКТИВНОСТЬ
zh_hans: 活动

# settings.notifications.section.wellness
source: WELLNESS
ru: ЗДОРОВЬЕ
zh_hans: 健康

# settings.notifications.sleepWindDown.subtitle
source: Evening reminders to slow down
ru: Вечерние напоминания замедлиться
zh_hans: 晚间提醒：请放慢节奏

# settings.notifications.sleepWindDown.title
source: Sleep Wind-down
ru: Подготовка ко сну
zh_hans: 入睡前准备

# settings.notifications.title
source: Notifications
ru: Уведомления
zh_hans: 通知

# settings.nutritionGoal.profileSubtitle
source: Calorie trajectory for training days
ru: Траектория калорий в тренировочные дни
zh_hans: 训练日的热量摄入轨迹

# settings.nutritionGoal.setupSubtitle
source: Choose your goal — Health has no weight or height yet
ru: Выберите цель — в Health пока нет веса или роста
zh_hans: 设定您的目标——健康指标目前尚未包含体重或身高

# settings.nutritionGoal.subtitle
source: Choose how WeekFit should aim your daily calories.
ru: Выберите, как WeekFit будет настраивать дневные калории.
zh_hans: 选择 WeekFit 对您每日卡路里摄入量的设定目标。

# settings.nutritionGoal.title
source: Nutrition Goal
ru: Цель питания
zh_hans: 饮食目标

# settings.profile.appleHealthConnected
source: Apple Health connected
ru: Apple Health подключен
zh_hans: Apple Health 已连接

# settings.profile.badge.connected
source: Connected
ru: Подключено
zh_hans: 有关的

# settings.profile.badge.setup
source: Setup
ru: Настроить
zh_hans: 设置

# settings.profile.bodyGoal.autoSubtitleFormat
source: %@ (from Health)
ru: %@ (из Health)
zh_hans: %@ （来自健康）

# settings.profile.bodyGoal.footerWithHealth
source: Your choice overrides the automatic recommendation from Health.
ru: Ваш выбор заменяет автоматическую рекомендацию из Health.
zh_hans: 您的选择将替代 Health 提供的自动推荐。

# settings.profile.bodyGoal.footerWithoutHealth
source: Connect Health later to refine targets automatically.
ru: Подключите Health позже — цели станут точнее автоматически.
zh_hans: 稍后连接 Health，即可自动优化目标。

# settings.profile.bodyGoal.missingHealthNote
source: Apple Health does not have your weight or height yet. Pick the goal that fits you — calories and activity targets will follow it.
ru: В Apple Health пока нет веса или роста. Выберите цель — от неё посчитаются калории и активность.
zh_hans: Apple Health 目前尚未获取您的体重或身高数据。请选择适合您的目标——卡路里与活动目标将自动随之设定。

# settings.profile.bodyGoal.option.gain
source: Gain muscle
ru: Наращивать массу
zh_hans: 增肌

# settings.profile.bodyGoal.option.gain.subtitle
source: Small surplus with extra protein
ru: Небольшой профицит и больше белка
zh_hans: 小幅盈余及更多蛋白质

# settings.profile.bodyGoal.option.lose
source: Lose weight
ru: Снижать вес
zh_hans: 减重

# settings.profile.bodyGoal.option.lose.subtitle
source: Moderate calorie deficit, higher protein
ru: Умеренный дефицит калорий, больше белка
zh_hans: 适度热量缺口，增加蛋白质摄入

# settings.profile.bodyGoal.option.maintain
source: Maintain weight
ru: Поддерживать вес
zh_hans: 维持体重

# settings.profile.bodyGoal.option.maintain.subtitle
source: Balanced intake for stable weight
ru: Баланс калорий для стабильного веса
zh_hans: 维持体重稳定所需的均衡膳食摄入

# settings.profile.bodyGoal.setupSubtitle
source: Choose your goal — Health has no weight or height yet
ru: Выберите цель — в Health пока нет веса или роста
zh_hans: 设定您的目标——健康指标目前尚未包含体重或身高

# settings.profile.bodyGoal.suggestionFormat
source: Based on your Health data, we would suggest: %@
ru: По данным Health мы бы предложили: %@
zh_hans: 根据您的健康数据，我们建议您考虑：%@

# settings.profile.bodyGoal.title
source: Body Goal
ru: Цель по весу
zh_hans: 身体目标

# settings.profile.connectHealthPlanning
source: Connect Health for smarter planning
ru: Подключите Apple Health для более точного плана
zh_hans: 连接 Health，实现更智能的规划

# settings.profile.edit.headline
source: Personalize your experience.
ru: Настройте приложение под себя.
zh_hans: 个性化您的体验。

# settings.profile.edit.localNote
source: This stays local on your device.
ru: Это хранится локально на вашем устройстве.
zh_hans: 该内容将仅保留在您设备上。

# settings.profile.edit.nameField
source: Name or nickname
ru: Имя или никнейм
zh_hans: 姓名或昵称

# settings.profile.edit.namePlaceholder
source: Max
ru: Макс
zh_hans: 最高的

# settings.profile.edit.title
source: Personalization
ru: Персонализация
zh_hans: 个性化

# settings.profile.footer.privacy
source: Private by design. Stored on your device.
ru: Приватно по замыслу. Данные хранятся на устройстве.
zh_hans: 默认私密模式。数据存储于您的设备中。

# settings.profile.healthSetupNeeded
source: Health setup needed
ru: Нужно настроить Здоровье
zh_hans: 需要建立健康保障体系

# settings.profile.healthSystem.bodyGoalPrompt
source: Open personalization to choose your body goal
ru: Откройте персонализацию и выберите цель по весу
zh_hans: 开启个性化设置，选择您的身材目标

# settings.profile.healthSystemFallback
source: Your health system
ru: Ваша система здоровья
zh_hans: 您的健康系统

# settings.profile.item.healthSignals
source: Health Signals
ru: Сигналы здоровья
zh_hans: 健康信号

# settings.profile.item.healthSignals.connectedSubtitle
source: Sleep, workouts and recovery connected.
ru: Сон, тренировки и восстановление подключены.
zh_hans: 睡眠、训练与恢复均已纳入计划。

# settings.profile.item.healthSignals.setupSubtitle
source: Connect Health to improve recommendations.
ru: Подключите Apple Health, чтобы улучшить рекомендации.
zh_hans: 连接 Health 以优化推荐建议。

# settings.profile.item.healthSignals.subtitle
source: Powered by Apple Health & Apple Watch
ru: Работает на данных Apple Health и Apple Watch
zh_hans: 由 Apple Health 与 Apple Watch 提供支持

# settings.profile.item.helpSupport
source: Help & Support
ru: Помощь и поддержка
zh_hans: 帮助与支持

# settings.profile.item.helpSupport.subtitle
source: Help, guides and feedback
ru: Помощь, инструкции и обратная связь
zh_hans: 帮助、指南与反馈

# settings.profile.item.notifications
source: Notifications
ru: Уведомления
zh_hans: 通知

# settings.profile.item.notifications.subtitle
source: Workout and recovery reminders
ru: Напоминания о тренировках и восстановлении
zh_hans: 训练与恢复提醒

# settings.profile.item.privacy
source: Privacy
ru: Приватность
zh_hans: 隐私

# settings.profile.item.privacy.subtitle
source: Control how WeekFit handles your data
ru: Управляйте тем, как WeekFit обрабатывает ваши данные
zh_hans: 控制 WeekFit 如何处理您的数据

# settings.profile.item.termsPrivacy
source: Terms & Privacy
ru: Условия и конфиденциальность
zh_hans: 条款与隐私政策

# settings.profile.item.termsPrivacy.subtitle
source: Privacy and permissions
ru: Приватность и разрешения
zh_hans: 隐私与授权

# settings.profile.recoverySystemActive
source: Recovery system active
ru: Восстановление активно
zh_hans: 恢复 system active

# settings.profile.resetConfirm.message
source: This will delete meals, logs, activities, coach history, cached images, and local preferences stored on this device. This cannot be undone.
ru: Это удалит блюдо, журналы, активности, историю Тренера, кэшированные изображения и локальные настройки на этом устройстве. Это действие нельзя отменить.
zh_hans: 此操作将清除该设备上的菜品、日志、活动记录、教练历史记录、缓存图像及本地设置。此操作不可撤销。

# settings.profile.resetConfirm.primary
source: Reset Data
ru: Сбросить данные
zh_hans: 重置数据

# settings.profile.resetConfirm.title
source: Reset local data?
ru: Сбросить локальные данные?
zh_hans: 清除本地数据？

# settings.profile.resetFailed.title
source: Reset failed
ru: Не удалось сбросить
zh_hans: 未成功清除

# settings.profile.resetLocalData
source: Reset local data
ru: Сбросить локальные данные
zh_hans: 清除本地数据

# settings.profile.resettingLocalData
source: Resetting...
ru: Сбрасываем...
zh_hans: 重置中...

# settings.profile.section.developer
source: Developer
ru: Разработчик
zh_hans: 开发者

# settings.profile.section.privacyData
source: Privacy & Data
ru: Приватность и данные
zh_hans: 隐私与数据

# settings.profile.section.settings
source: Settings
ru: Настройки
zh_hans: 设置

# settings.profile.section.support
source: Support
ru: Поддержка
zh_hans: 支持

# settings.profile.section.system
source: Your system
ru: Ваша система
zh_hans: 您的系统

# settings.profile.shareProductAnalytics.subtitle
source: Help us improve WeekFit by sharing how you use the app.
ru: Помогите улучшать WeekFit, делясь тем, как вы пользуетесь приложением.
zh_hans: 欢迎分享您使用 WeekFit 的应用体验，帮助我们优化这款应用。

# settings.profile.shareProductAnalytics.title
source: Share Usage Data
ru: Делиться данными об использовании
zh_hans: 分享使用数据

# settings.profile.signal.adaptive
source: Adaptive
ru: Адаптивно
zh_hans: 自适应

# settings.profile.signal.health
source: Health
ru: Здоровье
zh_hans: 健康

# settings.profile.signal.private
source: Private
ru: Приватно
zh_hans: 私有的

# settings.profile.signOut
source: Sign Out
ru: Выйти
zh_hans: 退出登录

# settings.profile.title
source: Settings
ru: Настройки
zh_hans: 设置

# settings.root.section.preferences
source: Preferences
ru: Настройки приложения
zh_hans: 偏好设置

# settings.root.title
source: Settings
ru: Настройки
zh_hans: 设置

# settings.units.a11y.selected
source: Selected.
ru: Выбрано.
zh_hans: 已选择。

# settings.units.footer
source: Changes apply immediately.
ru: Изменения применяются сразу.
zh_hans: 变更立即生效。

# settings.units.option.automatic
source: Automatic
ru: Автоматически
zh_hans: 自动

# settings.units.option.automatic.subtitle
source: Uses your device settings
ru: Использует настройки устройства
zh_hans: 使用设备设置

# settings.units.option.metric
source: Metric
ru: Метрическая
zh_hans: 公制

# settings.units.option.metric.subtitle
source: Kilometres · kilograms · Celsius
ru: Километры · килограммы · цельсий
zh_hans: 公里 · 千克 · 摄氏度

# settings.units.option.uk
source: United Kingdom
ru: Великобритания
zh_hans: 英国

# settings.units.option.uk.subtitle
source: Miles · stone or pounds · Celsius
ru: Мили · стоун и фунты · цельсий
zh_hans: 英里·码或磅·摄氏度

# settings.units.option.us
source: United States
ru: США
zh_hans: 美国

# settings.units.option.us.subtitle
source: Miles · pounds · Fahrenheit
ru: Мили · фунты · фаренгейт
zh_hans: 迈尔斯· · pounds · ·法氏度

# settings.units.recommended
source: Recommended
ru: Рекомендуется
zh_hans: 推荐

# settings.units.subtitle
source: How WeekFit displays units.
ru: Как отображаются единицы измерения в WeekFit.
zh_hans: WeekFit 的计量单位显示方式。

# settings.units.title
source: Units
ru: Единицы измерения
zh_hans: 单位

# settings.version.copied
source: Version information copied
ru: Информация о версии скопирована
zh_hans: 已复制版本信息

# settings.version.format
source: Version %@ (%@)
ru: Версия %@ (%@)
zh_hans: 版本 %@（%@）

# settings.weekFitAccess.a11yHint
source: Opens the WeekFit subscription screen.
ru: Открывает экран подписки WeekFit.
zh_hans: 打开 WeekFit 订阅界面。

# settings.weekFitAccess.title
source: WeekFit Access
ru: Доступ к WeekFit
zh_hans: 访问 WeekFit

source: Setup checklist
ru: Чек-лист настройки
zh_hans: 配置检查清单

source: Signal readiness
ru: Готовность сигналов
zh_hans: 信号就绪状态

source: Sleep data not appearing?
ru: Данные сна не появляются?
zh_hans: 看不到睡眠数据？

source: Sleep setup help
ru: Помощь с настройкой сна
zh_hans: 睡眠设置协助

source: Sleep stages and recovery insights may take a few valid nights before they appear consistently.
ru: Стадии сна и выводы о восстановлении могут начать стабильно появляться после нескольких корректно записанных ночей.
zh_hans: 睡眠阶段及关于恢复情况的结论，可能在经历数夜规范记录后开始稳定显现。

source: Small session logged
ru: Легкая активность записана
zh_hans: 轻度活动已记录

source: Something not working right? Reach out anytime.
ru: Что-то работает не так? Напишите нам в любое время.
zh_hans: 是否出现什么问题？欢迎随时联系我们。

source: Start Activity
ru: Начать активность
zh_hans: 开始活动

# support.back
source: Back
ru: Назад
zh_hans: 返回

# support.contactSupport
source: Contact Support
ru: Связаться с поддержкой
zh_hans: 联系支持团队

# support.contactSupport.subtitle
source: Questions, bugs, or feedback
ru: Вопросы, ошибки или обратная связь
zh_hans: 问题、缺陷或反馈

# support.copyEmailAddress
source: Copy Email Address
ru: Скопировать email
zh_hans: 复制电子邮件地址

# support.emailCopied
source: Email copied
ru: Адрес скопирован
zh_hans: 邮件已复制

# support.faq.item01.text
source: WeekFit is your personal training and recovery coach. It helps you plan workouts, meals, hydration, sleep, and routines in one place, while guiding you throughout the day using your activity, recovery, and health data.
ru: WeekFit — ваш персональный помощник для тренировок и восстановления. Он помогает планировать тренировки, питание, воду, сон и рутины в одном месте и подсказывает, что важно в течение дня.
zh_hans: WeekFit —— 您的专属训练与恢复助手。它可在单一界面中帮您规划训练计划、膳食安排、饮水管理、睡眠安排及日常事务，并提醒您一天中需要注意的关键事项。

# support.faq.item01.title
source: What is WeekFit?
ru: Что такое WeekFit?
zh_hans: 什么是 WeekFit？

# support.faq.item02.text
source: Plan helps you organize your upcoming week ahead. Today reacts to what is actually happening during the day. Coach then adapts suggestions based on your activity, recovery, meals, hydration, sleep, and timing.
ru: План помогает заранее организовать неделю. Сегодня реагирует на то, что реально происходит в течение дня. Тренер адаптирует советы с учетом активности, восстановления, питания, воды, сна и времени.
zh_hans: 本计划助您规划接下来的一周生活。每日更新模块会根据当日实际发生的情况进行动态调整；随后，教练将根据您的活动状态、恢复情况、饮食、水分补充、睡眠及时间安排，量身定制优化建议。

# support.faq.item02.title
source: How does WeekFit work day to day?
ru: Как WeekFit работает каждый день?
zh_hans: WeekFit 在日常使用中是如何运作的？

# support.faq.item03.text
source: Today focuses on your current day, metrics, and live activity. Plan is where you organize workouts, meals, recovery, sleep, and routines ahead of time.
ru: Сегодня показывает текущий день, метрики и живую активность. План нужен, чтобы заранее организовать тренировки, питание, восстановление, сон и рутины.
zh_hans: 本页面显示当前日期、相关指标及实时活动数据。制定计划有助于提前规划训练、营养、恢复、睡眠及日常作息。

# support.faq.item03.title
source: What is the difference between Today and Plan?
ru: Чем отличаются Сегодня и План?
zh_hans: “今日”与“计划”有何不同？

# support.faq.item04.text
source: Plan helps you organize things ahead of time. Logging is for things that already happened during the day — like meals, coffee, water, workouts, recovery, or sleep routines.
ru: План помогает заранее организовать дела. Логирование — для того, что уже произошло в течение дня: еды, кофе, воды, тренировок, восстановления или рутин сна.
zh_hans: 计划功能可帮助您提前整理各项事务；而日志记录功能则用于记录当天已发生的事项——例如用餐、饮用咖啡与饮水、锻炼、恢复活动或睡眠习惯等。

# support.faq.item04.title
source: What is the difference between planning and logging?
ru: Чем отличаются планирование и логирование?
zh_hans: 规划与记录有何区别？

# support.faq.item05.text
source: WeekFit shows data that already exists in Apple Health. Check Health permissions and make sure Apple Health has data for the selected day.
ru: WeekFit показывает данные, которые уже есть в Apple Health. Проверьте разрешения Health и убедитесь, что в Apple Health есть данные за выбранный день.
zh_hans: WeekFit 显示的是 Apple Health 中已存在的数据。请检查 Health 应用的权限，并确保 Apple Health 中已包含所选日期的相关数据。

# support.faq.item05.title
source: Why are my metrics empty?
ru: Почему мои метрики пустые?
zh_hans: 为什么我的指标为空？

# support.faq.item06.text
source: No. You can use WeekFit without Apple Watch. But sleep, workouts, recovery, and activity data may be missing or less accurate, which can affect coaching insights and recommendations.
ru: Нет. WeekFit можно использовать без Apple Watch. Но данные сна, тренировок, восстановления и активности могут отсутствовать или быть менее точными, что влияет на инсайты Тренера.
zh_hans: 不。您无需 Apple Watch 也可使用 WeekFit。但睡眠、训练、恢复及活动相关数据可能会缺失或准确性降低，进而影响训练指导中的洞察与建议。

# support.faq.item06.title
source: Do I need an Apple Watch?
ru: Нужен ли Apple Watch?
zh_hans: 我需要 Apple Watch 吗？

# support.faq.item07.text
source: Daily Status gives a simple overview of your activity, nutrition, recovery, sleep, hydration, and Apple Health data throughout the day.
ru: Статус дня дает простой обзор активности, питания, восстановления, сна, гидратации и данных Apple Health в течение дня.
zh_hans: 「每日状态」功能可为您全天内的活动、营养摄入、恢复情况、睡眠、水分补充以及 Apple Health 数据提供简明概览。

# support.faq.item07.title
source: What is Daily Status?
ru: Что такое Статус дня?
zh_hans: 什么是“今日状态”？

# support.faq.item08.text
source: The percentages help you understand balance during the day. They are not meant to be perfect scores or goals to chase.
ru: Проценты помогают понимать баланс дня. Это не идеальные оценки и не цели, за которыми нужно гнаться.
zh_hans: 百分比有助于把握当天的平衡状态。它们并非完美的评估指标，也非需要全力追求的目标。

# support.faq.item08.title
source: What do the percentages mean?
ru: Что означают проценты?
zh_hans: 利率是什么意思？

# support.faq.item09.text
source: Activity can go above 100% when your movement, workouts, exercise minutes, or daily activity go beyond your current activity goal.
ru: Активность может превышать 100%, когда движение, тренировки, минуты упражнений или дневная активность превышают текущую цель активности.
zh_hans: 当您的身体活动量、训练时长、运动分钟数或日常活动量超过当前活动目标时，活动率可超过 100%。

# support.faq.item09.title
source: Why can Activity go above 100%?
ru: Почему Активность может быть выше 100%?
zh_hans: 为什么活动率可能超过 100%？

# support.faq.item10.text
source: WeekFit looks at your workouts, movement, recovery, body data, meals, and Apple Health information to build personalized Activity and Nutrition targets. As your day changes, targets can also adjust to better reflect your current energy and recovery needs.
ru: WeekFit учитывает тренировки, движение, восстановление, данные тела, питание и Apple Health, чтобы строить персональные цели Активности и Питания. Когда день меняется, цели могут обновляться.
zh_hans: WeekFit 综合考量训练、运动、恢复、身体数据、营养及 Apple Health 信息，以制定个性化的「活动」与「营养」目标。当每日情况发生变化时，这些目标亦可相应更新。

# support.faq.item10.title
source: How are your Activity and Nutrition targets calculated?
ru: Как рассчитываются цели Активности и Питания?
zh_hans: 您的活动与营养目标是如何计算的？

# support.faq.item11.text
source: BMR (Basal Metabolic Rate) is your estimated base energy need — the calories your body uses at rest.
ru: BMR (базальный обмен) — это примерная базовая потребность в энергии: калории, которые тело тратит в покое.
zh_hans: 基础代谢率（BMR）是您估算的基础能量需求——即您的身体在静息状态下消耗的卡路里。

# support.faq.item11.title
source: What is BMR?
ru: Что такое BMR?
zh_hans: 什么是基础代谢率（BMR）？

# support.faq.item12.text
source: TDEE (Total Daily Energy Expenditure) combines your base metabolism with movement, workouts, and daily activity to estimate your daily energy needs.
ru: TDEE (общий дневной расход энергии) объединяет базовый обмен, движение, тренировки и дневную активность, чтобы оценить дневную потребность в энергии.
zh_hans: TDEE（每日总能量消耗）综合基础代谢率、身体活动、运动训练及日常活动等因素，用以评估每日能量需求。

# support.faq.item12.title
source: What is TDEE?
ru: Что такое TDEE?
zh_hans: 什么是每日总能量消耗（TDEE）？

# support.faq.item13.text
source: WeekFit starts with your estimated BMR, then builds a dynamic TDEE using workouts, movement, active calories, recovery, and daily activity. Calories, protein, carbs, fats, and water targets then adapt based on your selected goal.
ru: WeekFit начинает с примерного BMR, затем строит динамический TDEE с учетом тренировок, движения, активных калорий, восстановления и дневной активности. Калории, белки, углеводы, жиры и вода адаптируются к контексту.
zh_hans: WeekFit 首先基于基础代谢率（BMR）启动计算，随后结合训练计划、日常活动、主动代谢热量、恢复期及日间活动量，动态推算每日总能量消耗（TDEE）。蛋白质、碳水化合物、脂肪及水分摄入量均根据个体情况自动调整。

# support.faq.item13.title
source: How are Nutrition targets calculated?
ru: Как рассчитываются цели Питания?
zh_hans: 营养目标是如何计算的？

# support.faq.item14.text
source: WeekFit roughly follows:\n\nBMR + Activity + Workouts = Daily Energy Need\n\nYour selected goal then adjusts calories, protein, carbs, fats, and hydration targets.
ru: WeekFit примерно следует формуле: BMR + Активность + Тренировки = дневная потребность в энергии Выбранная цель затем корректирует калории, белки, углеводы, жиры и воду.
zh_hans: WeekFit 大致遵循以下公式： 基础代谢率 + 活动量 + 训练量 = 每日能量需求 所选目标随后会对卡路里、蛋白质、碳水化合物、脂肪及水分进行调整。

# support.faq.item14.title
source: How does WeekFit estimate calories?
ru: Как WeekFit оценивает калории?
zh_hans: WeekFit 是如何估算卡路里的？

# support.faq.item15.text
source: Protein is mainly based on body weight and your selected goal. Fats use a percentage of your calorie target. Carbs are calculated from the remaining calories after protein and fats.
ru: Белок в основном зависит от веса тела и выбранной цели. Жиры берутся как доля от цели калорий. Углеводы рассчитываются из оставшихся калорий после белков и жиров.
zh_hans: 蛋白质摄入量主要根据您的体重及设定的目标来确定；脂肪摄入量则基于您设定的热量目标百分比计算；碳水化合物摄入量则根据蛋白质与脂肪摄入后剩余的热量来推算。

# support.faq.item15.title
source: How are protein, carbs, and fats calculated?
ru: Как рассчитываются белки, углеводы и жиры?
zh_hans: 蛋白质、碳水化合物和脂肪是如何计算的？

# support.faq.item16.text
source: Water target is based mainly on body weight, with extra hydration added when your activity and active calories are higher.
ru: Цель воды в основном зависит от веса тела. Дополнительная гидратация добавляется, когда активность и активные калории выше.
zh_hans: 饮水量的主要取决于体重。当活动量及消耗的热量增加时，需补充额外水分。

# support.faq.item16.title
source: How is water target calculated?
ru: Как рассчитывается цель воды?
zh_hans: 用水量是如何计算的？

# support.faq.item17.text
source: WeekFit uses adaptive targets that react to workouts, movement, recovery, meals, and newly available Apple Health data throughout the day.
ru: WeekFit использует адаптивные цели, которые реагируют на тренировки, движение, восстановление, питание и новые данные Apple Health в течение дня.
zh_hans: WeekFit 采用自适应目标，这些目标会根据训练、活动、恢复、营养以及 Apple Health 在一天内提供的最新数据动态调整。

# support.faq.item17.title
source: Why do targets change during the day?
ru: Почему цели меняются в течение дня?
zh_hans: 为什么目标会在一天之内发生变化？

# support.faq.item18.text
source: WeekFit uses time-adaptive targets during the day. Morning targets are intentionally lighter so progress reflects where your day realistically is instead of expecting full-day nutrition too early.
ru: WeekFit использует цели, адаптированные ко времени дня. Утренние цели специально легче, чтобы прогресс отражал реальное состояние дня, а не требовал полного дневного объема сразу.
zh_hans: WeekFit 采用根据一天中的不同时段量身定制的目标。晨间目标特意设定得较为简单，以便进展情况能真实反映当日的实际状态，而非要求一次性完成全天的训练量。
